# ывести все числа от 1 до 10 включительно с помощью цикла for.
for i in range(1, 11):
    print(i)

# ывести все буквы строки hello по одной в строке с помощью цикла for.
my = 'hello'
for i in my:
    print(i)

# осчитать сумму всех чисел от 1 до 100 с помощью цикла while.
a = int(input())
while a >= 1 and a <= 100:
    print(a+1)
    a = int(input())

# айти и вывести максимальное число из списка [3, 7, 2, 9, 4] без использования функции max (через цикл и условие).
n = [3, 7, 2, 9, 4]
for i in range(n):
    if 

# з заданного списка чисел [5, 12, 7, 10, 3] вывести только чётные числа с помощью цикла и continue`.

# цикле for от 1 до 20 вывести числа, но остановить цикл, если встретится число, которое делится на 7 (использовать break).

# ана строка banana. Посчитать, сколько раз буква a встречается в строке.

# ывести все числа от 10 до 1 в обратном порядке с помощью цикла while.

# ан список слов ['apple', 'banana', 'cherry']. Вывести самое длинное слово из списка (использовать len).

# з списка [1, 2, 3, 4, 5, 6] вывести все числа, кроме тех, что делятся на 3 (использовать continue).
